Revit 2024 API
Material.MaterialCategory Property
 The name of the material category, e.g. 'Wood'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string MaterialCategory { get; set; }
Visual Basic
Public Property MaterialCategory As String
	Get
	Set
Visual C++
public:
property String^ MaterialCategory {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Material Class
Autodesk.Revit.DB Namespace